# TopElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..TopElevation Property
Stairs Class See Also
---
The top elevation of the stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TopElevation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TopElevation As Double
	Get
```

Visual C++
---
```text
public:
property double TopElevation {
	double get ();
}
```

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace